{
  "projects": [

    {
      "shortName": "Music Player",
      "image": "/assets/portfolio/music-player.png",
      "longName": "MUI music player integration with iTunes",
      "url": "",
      "githubUrl": "https://github.com/keeper54/music-player",
      "summary": "A sleek and modern music player application built with React and Material-UI (MUI) that integrates with the iTunes API. The app allows users to search for their favorite songs, albums, and artists, create playlists, and enjoy a seamless music listening experience. With a focus on user-friendly design and functionality, this music player offers features such as play, pause, skip, and volume control, all within an intuitive interface.",
      "techStack": [
        "React",
        "Node.js",
        "MUI",
        "Jest",
        "AWS"
      ]
    },
    {
      "shortName": "Creative Memories",
      "image": "/assets/portfolio/creative-memories-screenshot.png",
      "longName": "E-commerce and consultant sales support for Creative Memories",
      "url": "https://www.creativememories.com/",
      "githubUrl": "",
      "summary": "A comprehensive e-commerce platform developed for Creative Memories, a leading provider of scrapbooking and memory-keeping products. The platform supports both direct consumer sales and consultant-led sales, providing a seamless shopping experience for customers and an efficient management system for consultants. Features include product browsing, secure checkout, order tracking, and consultant management tools, all designed to enhance the overall user experience and drive sales growth.",
      "techStack": [
        ".NET",
        ".NET MVC",
        "ASP.NET",
        "HTML5",
        "CSS3",
        "JavaScript",
        "jQuery",
        "SQL Server"
      ]
    },
    {
      "shortName": "User Management Grid",
      "image": "/assets/portfolio/user-dashboard-list.png",
      "longName": "Security Interview Coding Challenge",
      "url": "",
      "githubUrl": "https://github.com/keeper54/user-management",
      "summary": "The result of a coding challenge for a staff engineer position. An Express server with a react front-end rendering a user management grid.",
      "techStack": [
        "React",
        "Node.js",
        "Express",
        "MUI",
        "Jest",
        "JSDoc"
      ]
    },
    {
      "shortName": "Hagerty Insurance",
      "image": "/assets/portfolio/hagerty-screenshot.png",
      "longName": "Hagerty Insurance Quote and Buy Flow",
      "url": "https://www.hagerty.com/",
      "githubUrl": "",
      "summary": "A comprehensive insurance quote and purchase application developed for Hagerty, a leading provider of classic car insurance. This web-based platform allows users to easily obtain insurance quotes, customize their coverage options, and complete the purchase process online. The application features a user-friendly interface, secure payment processing, and integration with Hagerty's backend systems to ensure a seamless experience for customers looking to protect their valuable vehicles.",
      "techStack": [
        "React",
        "C#",
        ".NET Core",
        "Salesforce Lightning Components",
        "Jest",
        "JSDoc"
      ]
    },
    {
      "shortName": "Norton Antivius Online Store",
      "image": "/assets/portfolio/norton-screenshot.png",
      "longName": "Online store created while with Digital River for Norton Antivius",
      "url": "",
      "githubUrl": "",
      "summary": "A robust global e-commerce platform developed for Norton Antivirus, enabling customers to easily browse, select, and purchase antivirus software and related products online. The online store features a secure shopping cart, multiple payment options, and a streamlined checkout process to enhance the user experience. Additionally, the platform is integrated with Norton’s inventory and customer management systems to ensure accurate product availability and efficient order fulfillment.",
      "techStack": [
        "XSLT",
        "JavaScript",
        "HTML5",
        "CSS3",
        "Struts",
        "JSP",
        "jQuery"
      ]
    },
    {
      "shortName": "2 Day Postcards",
      "image": "/assets/portfolio/2day.gif",
      "longName": "Online store for postcards, greeting cards, etc",
      "url": "https://www.2daypostcards.com",
      "githubUrl": "",
      "summary": "2daypostcards had a rudimentary design in place for their e-commerce site. They contacted me to design a website using the same content and structure in a more visually appealing manner. This would help make the site more appealing to a wide variety of clients, with the intent of keeping people at the site, thereby increasing sales. I created this site using nothing but CSS to control the graphics. Special attention was paid to cross-browser compatibility, so that the website looks the same in firefox, internet explorer, opera, and safari. Its estimated that sales increased at a steady rate of about 8% monthly since the projects inception. The site was my first crack at creating a custom template for CubeCart, an out of the box e-commerce solution perfect for small businesses who don't have the means to create a custom online store. Through the use of CSS and custom design work I was able to do exactly what was wanted, and achieve the clients goals.",
      "techStack": [
        "JavaScript",
        "HTML5",
        "CSS",
        "PHP",
        "MySQL",
        "jQuery"
      ]
    },
    {
      "shortName": "Aurelia Scheppers Portfolio",
      "image": "/assets/portfolio/aurelia.gif",
      "longName": "Online store created while with Digital River for Norton Antivius",
      "url": "",
      "githubUrl": "",
      "summary": "As a software engineer, I played a key role in developing and enhancing the personal online presence of an up and coming model and actress named Aurelia Scheppers. A model from Edina Minnesota, Aurelia came to us to help her establish a presence on the web.",
      "techStack": [
        "XSLT",
        "JavaScript",
        "HTML5",
        "CSS3",
        "Flash"
      ]
    },
    {
      "shortName": "Auto Insurance Sales",
      "image": "/assets/portfolio/aaa-insurance-screenshot.png",
      "longName": "Insurance sales site, multi-locale, AAA So-Cal",
      "url": "https://app.ace.aaa.com/insurance/auto/olb/contact/name/",
      "githubUrl": "",
      "summary": "While consulting, I had the opportunity to work on the AAA So-Cal auto insurance (via Club Labs) sales site. I was the techinical lead and SME for the effort. The site was a success and helped increase sales for AAA So-Cal.",
      "techStack": [
        "JavaScript",
        "HTML5",
        "CSS3"
      ]
    },
    {
      "shortName": "Angila Modeling",
      "image": "/assets/portfolio/angila.gif",
      "longName": "Portfolio for Angila, model and actress",
      "url": "",
      "githubUrl": "",
      "summary": "Following the success her friend/'s digital marketing campaign and site, Angila came to us to help her establish a presence on the web.",
      "techStack": [
        "JavaScript",
        "HTML5",
        "CSS3",
        "Flash"
      ]
    },
    {
      "shortName": "Hollander Parts",
      "image": "/assets/portfolio/hollander-parts-screenshot.png",
      "longName": "Online sales channel for automotive recycling yards",
      "url": "https://www.hollanderparts.com/",
      "githubUrl": "",
      "summary": "",
      "techStack": [
        "JavaScript",
        "HTML5",
        "CSS3",
        "jQuery",
        ".NET MVC",
        "C#",
        "SQL Server",
        "Entity Framework",
        "Bootstrap"
      ]
    }
  ]
}